const areaMapping = [
  { code: 420102, name: '江岸区', coordinate: [114.314546348008, 30.6445813614459] },
  { code: 420103, name: '江汉区', coordinate: [114.253537184978, 30.6062104122828] },
  { code: 420104, name: '硚口区', coordinate: [114.206198375571, 30.6002311468868] },
  { code: 420105, name: '汉阳区', coordinate: [114.203410792773, 30.5443122558212] },
  { code: 420106, name: '武昌区', coordinate: [114.318359126734, 30.5547567752937] },
  { code: 420107, name: '青山区', coordinate: [114.442693549033, 30.6237017968032] },
  { code: 420111, name: '洪山区', coordinate: [114.324338016005, 30.5165687463666] },
  { code: 420112, name: '东西湖', coordinate: [114.073100075718, 30.6928054677102] },
  { code: 420113, name: '汉南区', coordinate: [113.948644822037, 30.2875048200842] },
  { code: 420114, name: '蔡甸区', coordinate: [113.925626757252, 30.4578410284033] },
  { code: 420115, name: '江夏区', coordinate: [114.31916368979, 30.2134763954505] },
  { code: 420116, name: '黄陂区', coordinate: [114.349394407231, 30.9783277382214] },
  { code: 420117, name: '新洲区', coordinate: [114.748955103527, 30.8016124988956] },
  { code: 420106090, name: '东湖风景区', coordinate: [114.414842674791, 30.5566510524322] },
  { code: 420111090, name: '化工新区', coordinate: [114.516911043169, 30.6249451079428] },
  { code: 420114090, name: '经济开发区', coordinate: [114.127418495433, 30.4385898130368] },
  { code: 420115090, name: '东湖高新区', coordinate: [114.507943118985, 30.4339329919025] },
];

export default areaMapping;
